### Q1. Create a Pandas Series that contains the following data: 4, 8, 15, 16, 23, and 42. Then, print the series.

In [1]:
# Import Pandas 
import pandas as pd 
import logging

logging.basicConfig(filename="text.log",level =logging.INFO)

In [2]:
data= [4,8,15,16,23,42]
df=pd.Series(data)

logging.info("Data in series " + str(df) )
df

0     4
1     8
2    15
3    16
4    23
5    42
dtype: int64

### Q2. Create a variable of list type containing 10 elements in it, and apply pandas.Series function on the variable print it.

In [3]:
data1=["Raj","Mohan","Priti","Saloni","Shruti","Shivani","Aman","Amar","Anant","Nidhi"]
df1=pd.Series(data1)

logging.info("Data1 in series " + str(df1) )
df1

0        Raj
1      Mohan
2      Priti
3     Saloni
4     Shruti
5    Shivani
6       Aman
7       Amar
8      Anant
9      Nidhi
dtype: object

### Q3. Create a Pandas DataFrame that contains the following data:
|**Name** | **Age** | **Gender** |
|---|---|---|
| Alic |  25 | Female | 
|  Bob |  30 |  Male  |
|Claire|  27 | Female |

Then, print the DataFrame.

In [4]:
data2 = {'Name':['Alice','Bob','Claire'],
        'Age':[25,30,27],
        'Gender':['Female','Male','Female']}

df2 = pd.DataFrame(data2)

logging.info("Data2 in Data Frame " + str(df2) )
df2

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

### Q4. What is ‘DataFrame’ in pandas and how is it different from pandas.series? Explain with an example.

### Ans)


* **Pandas Series** is a one-dimensional labeled array whose object size cannot be changed. You can also see it as the primary building block for a DataFrame, making up its rows and columns. 
> **Series:-** 1D labeled array
1. One-dimensional
2. Homogenous – Series elements must be of the same data type.
3. Size-immutable – Once created, the size of a Series object cannot be changed.

* **Pandas DataFrame** Is a two-dimensional structure with columns and rows whose size can be changed. You can also think of it as a dictionary of Series objects. 
> **DataFrame:-** 2D labeled tabular structure
1. Two-dimensional
2. Heterogenous – DataFrame elements can have different data types.
3. Size-mutable – Elements can be dropped or added in an existing DataFrame.

In [5]:
# Example:- series
type(df1),df1

(pandas.core.series.Series,
 0        Raj
 1      Mohan
 2      Priti
 3     Saloni
 4     Shruti
 5    Shivani
 6       Aman
 7       Amar
 8      Anant
 9      Nidhi
 dtype: object)

In [6]:
# Example:- DataFrame
print(type(df2))
df2

<class 'pandas.core.frame.DataFrame'>

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

### Q5. What are some common functions you can use to manipulate data in a Pandas DataFrame? Can you give an example of when you might use one of these functions?

In [7]:
data3= {"Name":data1,
       "Age":[24,28,22,24,21,25,23,23,22,20],
       "collage":["BSC","BBA","B.com","MBA","BCA","MSC","MBA","M.com","MCA",None]}
df3=pd.DataFrame(data3)

logging.info("Data3 in Data Frame " + str(df3) )
df3

      Name  Age collage
0      Raj   24     BSC
1    Mohan   28     BBA
2    Priti   22   B.com
3   Saloni   24     MBA
4   Shruti   21     BCA
5  Shivani   25     MSC
6     Aman   23     MBA
7     Amar   23   M.com
8    Anant   22     MCA
9    Nidhi   20    None

In [8]:
# Head
df3.head()

     Name  Age collage
0     Raj   24     BSC
1   Mohan   28     BBA
2   Priti   22   B.com
3  Saloni   24     MBA
4  Shruti   21     BCA

In [9]:
# Tail
df3.tail()

      Name  Age collage
5  Shivani   25     MSC
6     Aman   23     MBA
7     Amar   23   M.com
8    Anant   22     MCA
9    Nidhi   20    None

In [10]:
# Dtypes
df3.dtypes

Name       object
Age         int64
collage    object
dtype: object

In [11]:
# Columns
df3.columns

Index(['Name', 'Age', 'collage'], dtype='object')

In [12]:
# Shape 
df3.shape

(10, 3)

In [13]:
# Size
df3.size

30

In [14]:
# Null count
df3.isnull().sum()

Name       0
Age        0
collage    1
dtype: int64

In [15]:
# Count
df3.count()

Name       10
Age        10
collage     9
dtype: int64

In [16]:
# Nunique
df3.nunique()

Name       10
Age         7
collage     8
dtype: int64

In [17]:
# Value Counts
df3.value_counts()

Name     Age  collage
Aman     23   MBA        1
Amar     23   M.com      1
Anant    22   MCA        1
Mohan    28   BBA        1
Priti    22   B.com      1
Raj      24   BSC        1
Saloni   24   MBA        1
Shivani  25   MSC        1
Shruti   21   BCA        1
dtype: int64

### Q6. Which of the following is mutable in nature Series, DataFrame, Panel?

### Ans) **Pandas Series, DataFrame and Panel** all of them are mutable but panel has been deprecated and is no longer recommended for use

### Q7. Create a DataFrame using multiple Series. Explain with an example.

In [18]:
d0= pd.Series([0,1,2,3,4,5,6,7,8,9])
d1= pd.Series(df3["Name"])
d2= pd.Series(df3["Age"])
d3= pd.Series(df3.collage)

data4= {"d0":d0,"d1":d1,"d2":d2,"d3":d3}
df4=pd.DataFrame(data4)

logging.info("Data4 in Data Frame " + str(df4) )
df4

   d0       d1  d2     d3
0   0      Raj  24    BSC
1   1    Mohan  28    BBA
2   2    Priti  22  B.com
3   3   Saloni  24    MBA
4   4   Shruti  21    BCA
5   5  Shivani  25    MSC
6   6     Aman  23    MBA
7   7     Amar  23  M.com
8   8    Anant  22    MCA
9   9    Nidhi  20   None